; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-55)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity v5 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l6)
    (at p2 l1)
    (at p3 l1)
    (at p4 l3)
    (at p5 l7)
    (at p6 l11)
    (at p7 l6)
    (at p8 l2)
    (at p9 l5)
    (at p10 l6)
    (at v1 l6)
    (at v2 l5)
    (at v3 l3)
    (at v4 l9)
    (at v5 l1)
    (road l5 l1)
    (road l8 l3)
    (road l5 l10)
    (road l1 l6)
    (road l7 l1)
    (road l4 l2)
    (road l3 l6)
    (road l4 l11)
    (road l11 l4)
    (road l2 l4)
    (road l1 l2)
    (road l10 l5)
    (road l2 l1)
    (road l1 l5)
    (road l6 l1)
    (road l3 l8)
    (road l9 l6)
    (road l1 l7)
    (road l6 l3)
    (road l6 l9)
    (road l4 l10)
    (road l10 l4)
    (road l2 l9)
    (road l9 l2)
    (road l1 l11)
    (road l11 l1)
    (road l4 l6)
    (road l6 l4)
    (road l2 l6)
    (road l6 l2)
    (road l10 l11)
    (road l11 l10)
    (road l7 l11)
    (road l11 l7)
    (road l6 l10)
    (road l10 l6)
    )
 (:goal (and 
(at p1 l11)
(at p2 l3)
(at p3 l11)
(at p4 l1)
(at p5 l6)
(at p6 l3)
(at p7 l11)
))
)

; plan
1. (pick-up v5 l1 p3 c0 c1)
   deleted: (at p3 l1) (capacity v5 c1)
   added: (in p3 v5) (capacity v5 c0)
   goals met: 0 of 7
2. (pick-up v1 l6 p1 c1 c2)
   deleted: (at p1 l6) (capacity v1 c2)
   added: (in p1 v1) (capacity v1 c1)
   goals met: 0 of 7
3. (pick-up v1 l6 p7 c0 c1)
   deleted: (at p7 l6) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 0 of 7
4. (drive v1 l6 l1)
   deleted: (at v1 l6)
   added: (at v1 l1)
   goals met: 0 of 7
5. (drive v1 l1 l11)
   deleted: (at v1 l1)
   added: (at v1 l11)
   goals met: 0 of 7
6. (drop v1 l11 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l11) (capacity v1 c1)
   goals met: 1 of 7
7. (drop v1 l11 p7 c1 c2)
   deleted: (in p7 v1) (capacity v1 c1)
   added: (at p7 l11) (capacity v1 c2)
   goals met: 2 of 7
8. (pick-up v1 l11 p6 c1 c2)
   deleted: (at p6 l11) (capacity v1 c2)
   added: (in p6 v1) (capacity v1 c1)
   goals met: 2 of 7
9. (drive v1 l11 l1)
   deleted: (at v1 l11)
   added: (at v1 l1)
   goals met: 2 of 7
10. (pick-up v1 l1 p2 c0 c1)
   deleted: (at p2 l1) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 2 of 7
11. (drive v1 l1 l6)
   deleted: (at v1 l1)
   added: (at v1 l6)
   goals met: 2 of 7
12. (drive v1 l6 l3)
   deleted: (at v1 l6)
   added: (at v1 l3)
   goals met: 2 of 7
13. (drop v1 l3 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l3) (capacity v1 c1)
   goals met: 3 of 7
14. (drop v1 l3 p6 c1 c2)
   deleted: (in p6 v1) (capacity v1 c1)
   added: (at p6 l3) (capacity v1 c2)
   goals met: 4 of 7
15. (drive v5 l1 l11)
   deleted: (at v5 l1)
   added: (at v5 l11)
   goals met: 4 of 7
16. (drop v5 l11 p3 c0 c1)
   deleted: (in p3 v5) (capacity v5 c0)
   added: (at p3 l11) (capacity v5 c1)
   goals met: 5 of 7
17. (pick-up v3 l3 p4 c1 c2)
   deleted: (at p4 l3) (capacity v3 c2)
   added: (in p4 v3) (capacity v3 c1)
   goals met: 5 of 7
18. (drive v3 l3 l6)
   deleted: (at v3 l3)
   added: (at v3 l6)
   goals met: 5 of 7
19. (drive v3 l6 l1)
   deleted: (at v3 l6)
   added: (at v3 l1)
   goals met: 5 of 7
20. (drop v3 l1 p4 c1 c2)
   deleted: (in p4 v3) (capacity v3 c1)
   added: (at p4 l1) (capacity v3 c2)
   goals met: 6 of 7
21. (drive v3 l1 l7)
   deleted: (at v3 l1)
   added: (at v3 l7)
   goals met: 6 of 7
22. (pick-up v3 l7 p5 c1 c2)
   deleted: (at p5 l7) (capacity v3 c2)
   added: (in p5 v3) (capacity v3 c1)
   goals met: 6 of 7
23. (drive v3 l7 l1)
   deleted: (at v3 l7)
   added: (at v3 l1)
   goals met: 6 of 7
24. (drive v3 l1 l6)
   deleted: (at v3 l1)
   added: (at v3 l6)
   goals met: 6 of 7
25. (drop v3 l6 p5 c1 c2)
   deleted: (in p5 v3) (capacity v3 c1)
   added: (at p5 l6) (capacity v3 c2)
   goals met: 7 of 7
